## Pandas

In [ ]:
## Series -- means which completly works with index positiobs

In [1]:
a=[1,2,3,4,5]
for i,j in enumerate(a):
    print('Index= ','value=',j)

Index=  value= 1
Index=  value= 2
Index=  value= 3
Index=  value= 4
Index=  value= 5

In [4]:
import pandas as pd
import numpy as np

In [9]:
a=pd.Series(np.arange(11),dtype=int)
a

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
dtype: int32

In [14]:
a=pd.Series(np.arange(11),dtype=float)
a

0      0.0
1      1.0
2      2.0
3      3.0
4      4.0
5      5.0
6      6.0
7      7.0
8      8.0
9      9.0
10    10.0
dtype: float64

In [16]:
a=pd.Series(np.arange(10,18),index=['A','B','C','D','E','F','G','H'])
a

A    10
B    11
C    12
D    13
E    14
F    15
G    16
H    17
dtype: int32

In [17]:
a=pd.Series(np.arange(10,18),index=['A','B','C','D','E','F','G','H'])
a

A    10
B    11
C    12
D    13
E    14
F    15
G    16
H    17
dtype: int32

In [18]:
a[1:5]

B    11
C    12
D    13
E    14
dtype: int32

In [20]:
a['B':'H']

B    11
C    12
D    13
E    14
F    15
G    16
H    17
dtype: int32

In [21]:
x=pd.Series(5,index=[0,1,2,3])
x

0    5
1    5
2    5
3    5
dtype: int64

In [22]:
## Data frames

In [24]:
import pandas as pd
import numpy as np

In [26]:
df=pd.DataFrame(np.arange(0,100).reshape(20,5))
df

     0   1   2   3   4
0    0   1   2   3   4
1    5   6   7   8   9
2   10  11  12  13  14
3   15  16  17  18  19
4   20  21  22  23  24
5   25  26  27  28  29
6   30  31  32  33  34
7   35  36  37  38  39
8   40  41  42  43  44
9   45  46  47  48  49
10  50  51  52  53  54
11  55  56  57  58  59
12  60  61  62  63  64
13  65  66  67  68  69
14  70  71  72  73  74
15  75  76  77  78  79
16  80  81  82  83  84
17  85  86  87  88  89
18  90  91  92  93  94
19  95  96  97  98  99

In [27]:
col=['col','col2','col3','col4','col5','Anil']
df=pd.DataFrame(np.arange(0,36).reshape(6,6),columns=col)
df

   col  col2  col3  col4  col5  Anil
0    0     1     2     3     4     5
1    6     7     8     9    10    11
2   12    13    14    15    16    17
3   18    19    20    21    22    23
4   24    25    26    27    28    29
5   30    31    32    33    34    35

In [116]:
col=['col1','col2','col3','col4','col5','Anil']
df=pd.DataFrame(np.arange(0,36).reshape(6,6),columns=col,index=ind)
df

      col1  col2  col3  col4  col5  Anil
ind1     0     1     2     3     4     5
ind2     6     7     8     9    10    11
ind3    12    13    14    15    16    17
ind4    18    19    20    21    22    23
ind5    24    25    26    27    28    29
ind6    30    31    32    33    34    35

In [117]:
a=np.arange(1,101).reshape(20,5)
a

array([[  1,   2,   3,   4,   5],
       [  6,   7,   8,   9,  10],
       [ 11,  12,  13,  14,  15],
       [ 16,  17,  18,  19,  20],
       [ 21,  22,  23,  24,  25],
       [ 26,  27,  28,  29,  30],
       [ 31,  32,  33,  34,  35],
       [ 36,  37,  38,  39,  40],
       [ 41,  42,  43,  44,  45],
       [ 46,  47,  48,  49,  50],
       [ 51,  52,  53,  54,  55],
       [ 56,  57,  58,  59,  60],
       [ 61,  62,  63,  64,  65],
       [ 66,  67,  68,  69,  70],
       [ 71,  72,  73,  74,  75],
       [ 76,  77,  78,  79,  80],
       [ 81,  82,  83,  84,  85],
       [ 86,  87,  88,  89,  90],
       [ 91,  92,  93,  94,  95],
       [ 96,  97,  98,  99, 100]])

In [119]:
df=pd.DataFrame(a)
df

     0   1   2   3    4
0    1   2   3   4    5
1    6   7   8   9   10
2   11  12  13  14   15
3   16  17  18  19   20
4   21  22  23  24   25
5   26  27  28  29   30
6   31  32  33  34   35
7   36  37  38  39   40
8   41  42  43  44   45
9   46  47  48  49   50
10  51  52  53  54   55
11  56  57  58  59   60
12  61  62  63  64   65
13  66  67  68  69   70
14  71  72  73  74   75
15  76  77  78  79   80
16  81  82  83  84   85
17  86  87  88  89   90
18  91  92  93  94   95
19  96  97  98  99  100

In [53]:
## Heads()--> Means first 5 will be selected

In [121]:
df.head()

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

In [109]:
## Tails()---> Means Last five will be selected

In [122]:
df.tail()

     0   1   2   3    4
15  76  77  78  79   80
16  81  82  83  84   85
17  86  87  88  89   90
18  91  92  93  94   95
19  96  97  98  99  100

In [52]:
## samnple()--->Which collects values Randomly

In [123]:
df.sample()

     0   1   2   3   4
15  76  77  78  79  80

In [61]:
col=['col1','col2','col3','col4','col5','Anil']
ind=['ind1','ind2','ind3','ind4','ind5','ind6']
df=pd.DataFrame(np.arange(0,36).reshape(6,6),columns=col,index=ind)
df

      col1  col2  col3  col4  col5  Anil
ind1     0     1     2     3     4     5
ind2     6     7     8     9    10    11
ind3    12    13    14    15    16    17
ind4    18    19    20    21    22    23
ind5    24    25    26    27    28    29
ind6    30    31    32    33    34    35

In [62]:
## Loc and iloc

In [63]:
df.loc['ind1':'ind2','col5':'Anil']

      col5  Anil
ind1     4     5
ind2    10    11

In [65]:
df.loc[['ind5'],['col2']]

      col2
ind5    25

In [66]:
df.loc[['ind5'],['col5']]

      col5
ind5    28

In [67]:
df.loc['ind5':'ind6','col5':'Anil']

      col5  Anil
ind5    28    29
ind6    34    35

In [69]:
df.loc['ind1':'ind3','col1']

ind1     0
ind2     6
ind3    12
Name: col1, dtype: int32

In [70]:
df.loc[['ind1'],['col1']]

      col1
ind1     0

In [72]:
df.loc[['ind1'],['Anil']]

      Anil
ind1     5

In [73]:
df.iloc[4:,4:]

      col5  Anil
ind5    28    29
ind6    34    35

In [74]:
df.iloc[1:4:]

      col1  col2  col3  col4  col5  Anil
ind2     6     7     8     9    10    11
ind3    12    13    14    15    16    17
ind4    18    19    20    21    22    23

In [75]:
df.iloc[2:,4:]

      col5  Anil
ind3    16    17
ind4    22    23
ind5    28    29
ind6    34    35

In [83]:
df.iloc[1:3,0:5]

      col1  col2  col3  col4  col5
ind2     6     7     8     9    10
ind3    12    13    14    15    16

In [99]:
df.iloc[2:,3:]

      col4  col5  Anil
ind3    15    16    17
ind4    21    22    23
ind5    27    28    29
ind6    33    34    35

In [100]:
df.iloc[0:5,0:5]

      col1  col2  col3  col4  col5
ind1     0     1     2     3     4
ind2     6     7     8     9    10
ind3    12    13    14    15    16
ind4    18    19    20    21    22
ind5    24    25    26    27    28

In [103]:
data={'a':['Hyd','Bangalore','Mumbai'] ,'b':['country','capital','expert']}
df=pd.DataFrame(data)
df

           a        b
0        Hyd  country
1  Bangalore  capital
2     Mumbai   expert

In [104]:
df['a']

0          Hyd
1    Bangalore
2       Mumbai
Name: a, dtype: object

In [106]:
data={'a':['Hyd','Bangalore','Mumbai'],'b':['country','capital','expert']}
df=pd.DataFrame(data)
df

           a        b
0        Hyd  country
1  Bangalore  capital
2     Mumbai   expert

In [107]:
df['a']

0          Hyd
1    Bangalore
2       Mumbai
Name: a, dtype: object

In [108]:
df['b']

0    country
1    capital
2     expert
Name: b, dtype: object